tests/load/load-test-config.yml
# Load testing configuration for Caregiver Platform
# Tests system performance under peak usage scenarios

config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 20
      name: "Peak load"
    - duration: 120
      arrivalRate: 10
      name: "Cool down"
  processor: "./test-processor.js"
  variables:
    phoneNumber: "+8801{{ $randomInt(30000000, 99999999) }}"
    password: "TestPassword123!"
    email: "test{{ $randomInt(1, 10000) }}@example.com"

scenarios:
  - name: "User Authentication Flow"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            phone: "{{ phoneNumber }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200
            - hasBody: true
      
      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  - name: "Dashboard Loading"
    weight: 25
    flow:
      - get:
          url: "/api/dashboard/stats"
          expect:
            - statusCode: 200
            - hasBody: true
      
      - get:
          url: "/api/users"
          expect:
            - statusCode: 200
            - hasBody: true
      
      - get:
          url: "/api/jobs"
          expect:
            - statusCode: 200
            - hasBody: true

  - name: "Patient Management"
    weight: 20
    flow:
      - get:
          url: "/api/patients"
          expect:
            - statusCode: 200
            - hasBody: true
      
      - post:
          url: "/api/patients"
          json:
            name: "Test Patient {{ $randomInt(1, 1000) }}"
            dateOfBirth: "1990-01-01"
            guardianId: "test-guardian-id"
            medicalHistory: "Test medical history"
            emergencyContact: "+8801700000000"
          expect:
            - statusCode: 201
            - hasBody: true

  - name: "Job Management"
    weight: 15
    flow:
      - get:
          url: "/api/jobs"
          expect:
            - statusCode: 200
            - hasBody: true
      
      - post:
          url: "/api/jobs"
          json:
            packageId: "test-package-id"
            patientId: "test-patient-id"
            companyId: "test-company-id"
            guardianId: "test-guardian-id"
            scheduledDate: "2025-12-01T10:00:00Z"
            duration: 4
            careType: "ELDER_CARE"
            status: "PENDING_ASSIGNMENT"
          expect:
            - statusCode: 201
            - hasBody: true

  - name: "Package Browsing"
    weight: 10
    flow:
      - get:
          url: "/api/packages"
          expect:
            - statusCode: 200
            - hasBody: true
      
      - get:
          url: "/api/packages/test-package-id"
          expect:
            - statusCode: 200
            - hasBody: true